'''Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, 
чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть'''

import random

n = int(input('Введите колличество монеток :')) #1 Решка ,2 Орел
i = 0
orel = 0
reshka = 0
mas =[]

while i < n:
    mas.append(random.randint(1, 2))
    i += 1
for j in mas:
    
    if j == 1:
        reshka+=1
    else:
        orel+=1

if orel < reshka:
    print(f'Количество монет, которые нужно перевернуть : {orel}')
else:
    print(f'Количество монет, которые нужно перевернуть : {reshka}')

print(mas)